InformationRegisters/Антропометрия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>Антропометрия</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Спортсмен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Спортсмен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПВХ</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/Тренировка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<AccumulationRegister>
		<Properties>
			<Name>Тренировка</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сделано</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Вес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Спортсмен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Спортсмен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Упражнение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Упражнение</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Стиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Стиль</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдИзм</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницаИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

CommonModules/ОбщегоНазначения/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

Функция ПолучитьВесСпортсменаСрезПоследних(Период, Спортсмен) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АнтропометрияСрезПоследних.Спортсмен КАК Спортсмен,
		|	АнтропометрияСрезПоследних.ПВХ КАК ПВХ,
		|	АнтропометрияСрезПоследних.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.Антропометрия.СрезПоследних(&Период) КАК АнтропометрияСрезПоследних
		|ГДЕ
		|	АнтропометрияСрезПоследних.Спортсмен = &Спортсмен
		|	И АнтропометрияСрезПоследних.ПВХ = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения.Вес)";
	
	Запрос.УстановитьПараметр("Период", 	Период);
	Запрос.УстановитьПараметр("Спортсмен", 	Спортсмен);
	
	РезультатЗапроса 		= Запрос.Выполнить();	
	ВыборкаДетальныеЗаписи 	= РезультатЗапроса.Выбрать();
	результатВес 			= 0;

	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		результатВес = ВыборкаДетальныеЗаписи.Вес;
	КонецЕсли;	
	
	Возврат результатВес;
	
КонецФункции

Функция ПолучитьКоличествоПодходовЗаТренировку(Тренировка, Упражнение, Стиль, ЕдИзм) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Тренировка.Упражнение КАК Упражнение,
		|	Тренировка.Стиль КАК Стиль,
		|	Тренировка.ЕдИзм КАК ЕдИзм,
		|	Тренировка.Регистратор КАК Регистратор,
		|	КОЛИЧЕСТВО(Тренировка.Вес) КАК КоличествоПодходов
		|ИЗ
		|	РегистрНакопления.Тренировка КАК Тренировка
		|ГДЕ
		|	Тренировка.Регистратор = &Регистратор
		|	И Тренировка.Упражнение = &Упражнение
		|	И Тренировка.Стиль = &Стиль
		|	И Тренировка.ЕдИзм = &ЕдИзм
		|
		|СГРУППИРОВАТЬ ПО
		|	Тренировка.Регистратор,
		|	Тренировка.Упражнение,
		|	Тренировка.Стиль,
		|	Тренировка.ЕдИзм";
	
	Запрос.УстановитьПараметр("Регистратор", Тренировка);
	Запрос.УстановитьПараметр("Упражнение", Упражнение);
	Запрос.УстановитьПараметр("Стиль", 		Стиль);
	Запрос.УстановитьПараметр("ЕдИзм", 		ЕдИзм);
	
	РезультатЗапроса 			= Запрос.Выполнить();	
	ВыборкаДетальныеЗаписи 		= РезультатЗапроса.Выбрать();
	результатКоличествоПодходов = 0;
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		результатКоличествоПодходов = ВыборкаДетальныеЗаписи.КоличествоПодходов;
	КонецЕсли;	
	
	Возврат результатКоличествоПодходов;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
#КонецОбласти
